[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:83:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Apartments" id="appnavbar-apartments-dropdown" data-testid="appnavbar-apartments-dropdown" >
-                    <NavDropdown.Item href="/apartments/list" data-testid="appnavbar-apartments-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/apartments/create" data-testid="appnavbar-apartments-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                )
+                true
               }
             </Nav>
killedBy: AppNavbar tests renders the apartments menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-apartments-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:83:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Apartments" id="appnavbar-apartments-dropdown" data-testid="appnavbar-apartments-dropdown" >
-                    <NavDropdown.Item href="/apartments/list" data-testid="appnavbar-apartments-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/apartments/create" data-testid="appnavbar-apartments-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_USER") || <NavDropdown title="Apartments" id="appnavbar-apartments-dropdown" data-testid="appnavbar-apartments-dropdown">
+                    <NavDropdown.Item href="/apartments/list" data-testid="appnavbar-apartments-list">List</NavDropdown.Item>
+                    {hasRole(currentUser, "ROLE_ADMIN") && <NavDropdown.Item href="/apartments/create" data-testid="appnavbar-apartments-create">Create</NavDropdown.Item>}
+                  </NavDropdown>
               }
             </Nav>
killedBy: AppNavbar tests renders the apartments menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-apartments-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:87:23
                   <NavDropdown title="Apartments" id="appnavbar-apartments-dropdown" data-testid="appnavbar-apartments-dropdown" >
                     <NavDropdown.Item href="/apartments/list" data-testid="appnavbar-apartments-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/apartments/create" data-testid="appnavbar-apartments-create">Create</NavDropdown.Item>
-                      )
+                      true
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the apartments menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-apartments-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:87:23
                   <NavDropdown title="Apartments" id="appnavbar-apartments-dropdown" data-testid="appnavbar-apartments-dropdown" >
                     <NavDropdown.Item href="/apartments/list" data-testid="appnavbar-apartments-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/apartments/create" data-testid="appnavbar-apartments-create">Create</NavDropdown.Item>
-                      )
+                      hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown.Item href="/apartments/create" data-testid="appnavbar-apartments-create">Create</NavDropdown.Item>
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the apartments menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-apartments-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:98:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Restaurants" id="appnavbar-restaurants-dropdown" data-testid="appnavbar-restaurants-dropdown" >
-                    <NavDropdown.Item href="/restaurants/list" data-testid="appnavbar-restaurants-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/restaurants/create" data-testid="appnavbar-restaurants-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                )
+                false
               }
             </Nav>
killedBy: AppNavbar tests renders the restaurants menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-restaurants-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
