[Killed] BlockStatement
main/components/Musics/MusicTable.js:9:47
 const showCell = (cell) => JSON.stringify(cell.row.values);
 
 
-const defaultDeleteCallback = async (cell) => {
-    console.log(`deleteCallback: ${showCell(cell)})`);
-    musicUtils.del(cell.row.values.id);
-}
+const defaultDeleteCallback = async (cell) => {}
 
 export default function MusicTable({
killedBy: MusicTable tests Delete button calls delete callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Musics/MusicTable.js:22:36
 
     const navigate = useNavigate();
  
-    const editCallback = (cell) => {
-        console.log(`editCallback: ${showCell(cell)})`);
-        navigate(`/musics/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     const detailsCallback = (cell) => {
killedBy: MusicTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/musics/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Musics/MusicTable.js:24:18
  
     const editCallback = (cell) => {
         console.log(`editCallback: ${showCell(cell)})`);
-        navigate(`/musics/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: MusicTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/musics/edit/2"
Received: ""

Number of calls: 1

<html>

[Killed] BlockStatement
main/components/Musics/MusicTable.js:27:39
         navigate(`/musics/edit/${cell.row.values.id}`)
     }
 
-    const detailsCallback = (cell) => {
-        console.log(`detailsCallback: ${showCell(cell)})`);
-        navigate(`/musics/details/${cell.row.values.id}`)
-    }
+    const detailsCallback = (cell) => {}
 
     const columns = [
killedBy: MusicTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/musics/details/2"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/Musics/MusicTable.js:42:9
             Header: 'Title',
             accessor: 'title',
         },
-        {
-            Header: 'Album',
-            accessor: 'album',
-        },
+        {},
         {
             Header: 'Artist',
killedBy: MusicTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Musics/MusicTable.js:48:23
         },
         {
             Header: 'Artist',
-            accessor: 'artist',
+            accessor: "",
         },
         {
killedBy: MusicTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MusicTable-cell-row-0-col-artist"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Musics/MusicTable.js:50:9
             Header: 'Artist',
             accessor: 'artist',
         },
-        {
-            Header: 'Genre',
-            accessor: 'genre',
-        },
+        {},
     ];
 
killedBy: MusicTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Musics/MusicTable.js:51:21
             accessor: 'artist',
         },
         {
-            Header: 'Genre',
+            Header: "",
             accessor: 'genre',
         },
killedBy: MusicTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: Genre. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
