[Killed] BlockStatement
main/pages/Musics/MusicCreatePage.js:6:43
 import { useNavigate } from 'react-router-dom'
 import { musicUtils } from 'main/utils/musicUtils';
 
-export default function MusicCreatePage() {
-
-  let navigate = useNavigate(); 
-
-  const onSubmit = async (music) => {
-    const createdMusic = musicUtils.add(music);
-    console.log("createdMusic: " + JSON.stringify(createdMusic));
-    navigate("/musics");
-  }  
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create New Music</h1>
-        <MusicForm submitAction={onSubmit} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function MusicCreatePage() {}
 
killedBy: MusicCreatePage tests renders without crashing
statusReason: Error: MusicCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Musics/MusicCreatePage.js:10:37
 
   let navigate = useNavigate(); 
 
-  const onSubmit = async (music) => {
-    const createdMusic = musicUtils.add(music);
-    console.log("createdMusic: " + JSON.stringify(createdMusic));
-    navigate("/musics");
-  }  
+  const onSubmit = async (music) => {}  
 
   return (
killedBy: MusicCreatePage tests redirects to /musics on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Musics/MusicCreatePage.js:12:17
 
   const onSubmit = async (music) => {
     const createdMusic = musicUtils.add(music);
-    console.log("createdMusic: " + JSON.stringify(createdMusic));
+    console.log("" + JSON.stringify(createdMusic));
     navigate("/musics");
   }  
killedBy: MusicCreatePage tests redirects to /musics on submit
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "createdMusic: {\"music\":{\"id\":3,\"title\":\"Everything Goes On\",\"album\":\"Everything Goes On\",\"artist\":\"Porter Robinson\",\"genre\":\"Pop\"}"
Received string:    "{\"music\":{\"id\":3,\"title\":\"Everything Goes On\",\"album\":\"Everything Goes On\",\"artist\":\"Porter Robinson\",\"genre\":\"Pop\"}}"
