[Killed] BlockStatement
main/pages/Musics/MusicDetailsPage.js:6:44
 import MusicTable from 'main/components/Musics/MusicTable';
 import { musicUtils } from 'main/utils/musicUtils';
 
-export default function MusicDetailsPage() {
-  let { id } = useParams();
-
-  const response = musicUtils.getById(id);
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Music Details</h1>
-        <MusicTable musics={[response.music]} showButtons={false} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function MusicDetailsPage() {}
 
killedBy: MusicDetailsPage tests renders without crashing
statusReason: Error: MusicDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BooleanLiteral
main/pages/Musics/MusicDetailsPage.js:15:60
     <BasicLayout>
       <div className="pt-2">
         <h1>Music Details</h1>
-        <MusicTable musics={[response.music]} showButtons={false} />
+        <MusicTable musics={[response.music]} showButtons={true} />
       </div>
     </BasicLayout>
killedBy: MusicDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="MusicTable-header-Delete"
  role="columnheader"
