[Killed] BlockStatement
main/pages/Musics/MusicEditPage.js:9:41
 import { useNavigate } from 'react-router-dom'
 
 
-export default function MusicEditPage() {
-    let { id } = useParams();
-
-    let navigate = useNavigate(); 
-
-    const response = musicUtils.getById(id);
-
-    const onSubmit = async (music) => {
-        const updatedMusic = musicUtils.update(music);
-        console.log("updatedMusic: " + JSON.stringify(updatedMusic));
-        navigate("/musics");
-    }  
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit Music</h1>
-                <MusicForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.music}/>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function MusicEditPage() {}
killedBy: MusicEditPage tests renders without crashing
statusReason: Error: MusicEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Musics/MusicEditPage.js:16:39
 
     const response = musicUtils.getById(id);
 
-    const onSubmit = async (music) => {
-        const updatedMusic = musicUtils.update(music);
-        console.log("updatedMusic: " + JSON.stringify(updatedMusic));
-        navigate("/musics");
-    }  
+    const onSubmit = async (music) => {}  
 
     return (
killedBy: MusicEditPage tests redirects to /musics on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Musics/MusicEditPage.js:18:21
 
     const onSubmit = async (music) => {
         const updatedMusic = musicUtils.update(music);
-        console.log("updatedMusic: " + JSON.stringify(updatedMusic));
+        console.log("" + JSON.stringify(updatedMusic));
         navigate("/musics");
     }  
killedBy: MusicEditPage tests redirects to /musics on submit
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "updatedMusic: {\"music\":{\"id\":3,\"title\":\"Cupid\",\"album\":\"The Beginning\",\"artist\":\"FIFTY FIFTY\",\"genre\":\"K-pop\"}"
Received string:    "{\"music\":{\"id\":3,\"title\":\"Cupid\",\"album\":\"The Beginning\",\"artist\":\"FIFTY FIFTY\",\"genre\":\"K-pop\"}}"
