[Killed] BlockStatement
main/pages/Musics/MusicIndexPage.js:17:44
 
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
-    const deleteCallback = async (cell) => {
-        console.log(`MusicIndexPage deleteCallback: ${showCell(cell)})`);
-        musicUtils.del(cell.row.values.id);
-        navigate("/musics");
-    }
+    const deleteCallback = async (cell) => {}
 
     return (
killedBy: MusicIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
main/pages/Musics/MusicIndexPage.js:26:41
     return (
         <BasicLayout>
             <div className="pt-2">
-                <Button style={{ float: "right" }} as={Link} to="/musics/create">
+                <Button style={{ float: "" }} as={Link} to="/musics/create">
                     Create Music
                 </Button>
killedBy: MusicIndexPage tests renders correct fields
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
