[Killed] BlockStatement
src/main/utils/musicUtils.js:2:19
 // get musics from local storage
-const get = () => {
-    const musicValue = localStorage.getItem("musics");
-    if (musicValue === undefined) {
-        const musicCollection = { nextId: 1, musics: [] }
-        return set(musicCollection);
-    }
-    const musicCollection = JSON.parse(musicValue);
-    if (musicCollection === null) {
-        const musicCollection = { nextId: 1, musics: [] }
-        return set(musicCollection);
-    }
-    return musicCollection;
-};
+const get = () => {};
 
 const getById = (id) => {
killedBy: MusicTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'musics')

[Killed] StringLiteral
src/main/utils/musicUtils.js:3:45
 // get musics from local storage
 const get = () => {
-    const musicValue = localStorage.getItem("musics");
+    const musicValue = localStorage.getItem("");
     if (musicValue === undefined) {
         const musicCollection = { nextId: 1, musics: [] }
killedBy: musicUtils tests get When musics is undefined in local storage, should set to empty list
statusReason: Error: Unexpected key:

[Killed] EqualityOperator
src/main/utils/musicUtils.js:4:9
 // get musics from local storage
 const get = () => {
     const musicValue = localStorage.getItem("musics");
-    if (musicValue === undefined) {
+    if (musicValue !== undefined) {
         const musicCollection = { nextId: 1, musics: [] }
         return set(musicCollection);
killedBy: musicUtils tests get When musics is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] BlockStatement
src/main/utils/musicUtils.js:4:35
 // get musics from local storage
 const get = () => {
     const musicValue = localStorage.getItem("musics");
-    if (musicValue === undefined) {
-        const musicCollection = { nextId: 1, musics: [] }
-        return set(musicCollection);
-    }
+    if (musicValue === undefined) {}
     const musicCollection = JSON.parse(musicValue);
     if (musicCollection === null) {
killedBy: musicUtils tests get When musics is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] ArrayDeclaration
src/main/utils/musicUtils.js:5:54
 const get = () => {
     const musicValue = localStorage.getItem("musics");
     if (musicValue === undefined) {
-        const musicCollection = { nextId: 1, musics: [] }
+        const musicCollection = { nextId: 1, musics: ["Stryker was here"] }
         return set(musicCollection);
     }
killedBy: musicUtils tests get When musics is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
-   "musics": Array [],
+   "musics": Array [

[Killed] ObjectLiteral
src/main/utils/musicUtils.js:5:33
 const get = () => {
     const musicValue = localStorage.getItem("musics");
     if (musicValue === undefined) {
-        const musicCollection = { nextId: 1, musics: [] }
+        const musicCollection = {}
         return set(musicCollection);
     }
killedBy: musicUtils tests get When musics is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "musics": Array [],
-   "nextId": 1,

[Killed] ConditionalExpression
src/main/utils/musicUtils.js:9:9
         return set(musicCollection);
     }
     const musicCollection = JSON.parse(musicValue);
-    if (musicCollection === null) {
+    if (true) {
         const musicCollection = { nextId: 1, musics: [] }
         return set(musicCollection);
killedBy: musicUtils tests get When musics is [] in local storage, should return []
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "musics", "{\"nextId\":1,\"musics\":[]}"

[Killed] EqualityOperator
src/main/utils/musicUtils.js:9:9
         return set(musicCollection);
     }
     const musicCollection = JSON.parse(musicValue);
-    if (musicCollection === null) {
+    if (musicCollection !== null) {
         const musicCollection = { nextId: 1, musics: [] }
         return set(musicCollection);
killedBy: musicUtils tests get When musics is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"musics": [], "nextId": 1}
Received: null

[Killed] ArrayDeclaration
src/main/utils/musicUtils.js:10:54
     }
     const musicCollection = JSON.parse(musicValue);
     if (musicCollection === null) {
-        const musicCollection = { nextId: 1, musics: [] }
+        const musicCollection = { nextId: 1, musics: ["Stryker was here"] }
         return set(musicCollection);
     }
killedBy: musicUtils tests get When musics is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
-   "musics": Array [],
+   "musics": Array [

[Killed] BlockStatement
src/main/utils/musicUtils.js:16:25
     return musicCollection;
 };
 
-const getById = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const musicCollection = get();
-    const musics = musicCollection.musics;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = musics.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `music with id ${id} not found` };
-    }
-    return { music: musics[index] };
-}
+const getById = (id) => {}
 
 // set musics in local storage
killedBy: musicUtils tests getById Check that getting an music by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"music": {"album": "Perception", "artist": "NF", "genre": "Hip hop", "id": 3, "title": "Let You Down"}}
Received: undefined

[Killed] ConditionalExpression
src/main/utils/musicUtils.js:24:43
     const musics = musicCollection.musics;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = musics.findIndex((r) => r.id == id);
+    const index = musics.findIndex((r) => false);
     if (index === -1) {
         return { "error": `music with id ${id} not found` };
killedBy: musicUtils tests getById Check that getting an music by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

  Object {
-   "music": Object {
-     "album": "Perception",

[Killed] ConditionalExpression
src/main/utils/musicUtils.js:24:43
     const musics = musicCollection.musics;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = musics.findIndex((r) => r.id == id);
+    const index = musics.findIndex((r) => true);
     if (index === -1) {
         return { "error": `music with id ${id} not found` };
killedBy: musicUtils tests getById Check that getting an music by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Object {
    "music": Object {
-     "album": "Perception",

[Killed] BlockStatement
src/main/utils/musicUtils.js:25:23
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = musics.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `music with id ${id} not found` };
-    }
+    if (index === -1) {}
     return { music: musics[index] };
 }
killedBy: musicUtils tests getById Check that getting a non-existing music returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "music with id 99 not found",
+   "music": undefined,

[Killed] UnaryOperator
src/main/utils/musicUtils.js:25:19
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = musics.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index === +1) {
         return { "error": `music with id ${id} not found` };
     }
killedBy: musicUtils tests getById Check that getting an music by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

  Object {
-   "music": Object {
-     "album": "Perception",

[Killed] StringLiteral
src/main/utils/musicUtils.js:26:27
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = musics.findIndex((r) => r.id == id);
     if (index === -1) {
-        return { "error": `music with id ${id} not found` };
+        return { "error": `` };
     }
     return { music: musics[index] };
killedBy: musicUtils tests getById Check that getting a non-existing music returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "music with id 99 not found",
+   "error": "",

[Killed] BlockStatement
src/main/utils/musicUtils.js:32:34
 }
 
 // set musics in local storage
-const set = (musicCollection) => {
-    localStorage.setItem("musics", JSON.stringify(musicCollection));
-    return musicCollection;
-};
+const set = (musicCollection) => {};
 
 // add a music to local storage
killedBy: musicUtils tests get When musics is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"musics": [], "nextId": 1}
Received: undefined

[Killed] StringLiteral
src/main/utils/musicUtils.js:33:26
 
 // set musics in local storage
 const set = (musicCollection) => {
-    localStorage.setItem("musics", JSON.stringify(musicCollection));
+    localStorage.setItem("", JSON.stringify(musicCollection));
     return musicCollection;
 };
killedBy: musicUtils tests get When musics is undefined in local storage, should set to empty list
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "musics", "{\"nextId\":1,\"musics\":[]}"
Received: "", "{\"nextId\":1,\"musics\":[]}"

Number of calls: 1

[Killed] BlockStatement
src/main/utils/musicUtils.js:38:24
 };
 
 // add a music to local storage
-const add = (music) => {
-    const musicCollection = get();
-    music = { ...music, id: musicCollection.nextId };
-    musicCollection.nextId++;
-    musicCollection.musics.push(music);
-    set(musicCollection);
-    return music;
-};
+const add = (music) => {};
 
 // update a music in local storage
killedBy: musicUtils tests add Starting from [], check that adding one music works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"album": "1996", "artist": "Ryuichi Sakamoto", "genre": "Classical", "id": 1, "title": "Bibo No Aozora"}
Received: undefined

[Killed] UpdateOperator
src/main/utils/musicUtils.js:41:5
 const add = (music) => {
     const musicCollection = get();
     music = { ...music, id: musicCollection.nextId };
-    musicCollection.nextId++;
+    musicCollection.nextId--;
     musicCollection.musics.push(music);
     set(musicCollection);
killedBy: musicUtils tests add Starting from [], check that adding one music works
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "musics", "{\"nextId\":2,\"musics\":[{\"id\":1,\"title\":\"Bibo No Aozora\",\"album\":\"1996\",\"artist\":\"Ryuichi Sakamoto\",\"genre\":\"Classical\"}]}"
Received: "musics", "{\"nextId\":0,\"musics\":[{\"id\":1,\"title\":\"Bibo No Aozora\",\"album\":\"1996\",\"artist\":\"Ryuichi Sakamoto\",\"genre\":\"Classical\"}]}"

Number of

[Killed] BlockStatement
src/main/utils/musicUtils.js:48:27
 };
 
 // update a music in local storage
-const update = (music) => {
-    const musicCollection = get();
-
-    const musics = musicCollection.musics;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = musics.findIndex((r) => r.id == music.id);
-    if (index === -1) {
-        return { "error": `music with id ${music.id} not found` };
-    }
-    musics[index] = music;
-    set(musicCollection);
-    return { musicCollection: musicCollection };
-};
+const update = (music) => {};
 
 // delete a music from local storage
killedBy: musicUtils tests update Check that updating an existing music works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ConditionalExpression
src/main/utils/musicUtils.js:54:43
     const musics = musicCollection.musics;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = musics.findIndex((r) => r.id == music.id);
+    const index = musics.findIndex((r) => false);
     if (index === -1) {
         return { "error": `music with id ${music.id} not found` };
killedBy: musicUtils tests update Check that updating an existing music works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 27
+ Received  +  1

  Object {
-   "musicCollection": Object {
-     "musics": Array [

[Killed] ConditionalExpression
src/main/utils/musicUtils.js:54:43
     const musics = musicCollection.musics;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = musics.findIndex((r) => r.id == music.id);
+    const index = musics.findIndex((r) => true);
     if (index === -1) {
         return { "error": `music with id ${music.id} not found` };
killedBy: musicUtils tests update Check that updating an non-existing music returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 24

  Object {
-   "error": "music with id 99 not found",
+   "musicCollection": Object {

[Killed] UnaryOperator
src/main/utils/musicUtils.js:55:19
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = musics.findIndex((r) => r.id == music.id);
-    if (index === -1) {
+    if (index === +1) {
         return { "error": `music with id ${music.id} not found` };
     }
killedBy: musicUtils tests update Check that updating an non-existing music returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 26

  Object {
-   "error": "music with id 99 not found",
+   "musicCollection": Object {

[Killed] ConditionalExpression
src/main/utils/musicUtils.js:55:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = musics.findIndex((r) => r.id == music.id);
-    if (index === -1) {
+    if (false) {
         return { "error": `music with id ${music.id} not found` };
     }
killedBy: musicUtils tests update Check that updating an non-existing music returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 26

  Object {
-   "error": "music with id 99 not found",
+   "musicCollection": Object {

[Killed] BlockStatement
src/main/utils/musicUtils.js:64:21
 };
 
 // delete a music from local storage
-const del = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const musicCollection = get();
-    const musics = musicCollection.musics;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = musics.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `music with id ${id} not found` };
-    }
-    musics.splice(index, 1);
-    set(musicCollection);
-    return { musicCollection: musicCollection };
-};
+const del = (id) => {};
 
 const musicUtils = {
killedBy: musicUtils tests del Check that deleting an music by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"musicCollection": {"musics": [{"album": "The Beginning", "artist": "FIFTY FIFTY", "genre": "K-pop", "id": 2, "title": "Cupid"}, {"album": "?", "artist": "XXXTentacion", "genre": "Pop", "id": 4, "title": "NUMB"}], "nextId": 5}}
Received: undefined

[Killed] EqualityOperator
src/main/utils/musicUtils.js:72:43
     const musics = musicCollection.musics;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = musics.findIndex((r) => r.id == id);
+    const index = musics.findIndex((r) => r.id != id);
     if (index === -1) {
         return { "error": `music with id ${id} not found` };
killedBy: musicUtils tests del Check that deleting an music by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

@@ -1,14 +1,14 @@
  Object {
    "musicCollection": Object {

[Killed] ArrowFunction
src/main/utils/musicUtils.js:72:36
     const musics = musicCollection.musics;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = musics.findIndex((r) => r.id == id);
+    const index = musics.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `music with id ${id} not found` };
killedBy: musicUtils tests del Check that deleting an music by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 19
+ Received  +  1

  Object {
-   "musicCollection": Object {
-     "musics": Array [

[Killed] ConditionalExpression
src/main/utils/musicUtils.js:73:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = musics.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (false) {
         return { "error": `music with id ${id} not found` };
     }
killedBy: musicUtils tests del Check that deleting a non-existing music returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 19

  Object {
-   "error": "music with id 99 not found",
+   "musicCollection": Object {

[Killed] ObjectLiteral
src/main/utils/musicUtils.js:74:16
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = musics.findIndex((r) => r.id == id);
     if (index === -1) {
-        return { "error": `music with id ${id} not found` };
+        return {};
     }
     musics.splice(index, 1);
killedBy: musicUtils tests del Check that deleting a non-existing music returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "music with id 99 not found",
- }
