[Killed] StringLiteral
main/components/Restaurants/RestaurantTable.js:22:18
     }
 
     const detailsCallback = (cell) => {
-        navigate(`/restaurants/details/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: UserTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/restaurants/details/2"
Received: ""

Number of calls: 1

<html>
