[Killed] BlockStatement
main/pages/Restaurants/RestaurantIndexPage.js:8:47
 import RestaurantTable from 'main/components/Restaurants/RestaurantTable';
 import { useCurrentUser } from 'main/utils/currentUser'
 
-export default function RestaurantIndexPage() {
-
-  const currentUser = useCurrentUser();
-
-  const { data: restaurants, error: _error, status: _status } =
-    useBackend(
-      // Stryker disable next-line all : don't test internal caching of React Query
-      ["/api/restaurant/all"],
-      { method: "GET", url: "/api/restaurant/all" },
-      []
-    );
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Restaurants</h1>
-        <RestaurantTable restaurants={restaurants} currentUser={currentUser} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function RestaurantIndexPage() {}
killedBy: RestaurantIndexPage tests renders without crashing for regular user
statusReason: Error: RestaurantIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/pages/Restaurants/RestaurantIndexPage.js:16:29
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       ["/api/restaurant/all"],
-      { method: "GET", url: "/api/restaurant/all" },
+      { method: "GET", url: "" },
       []
     );
killedBy: RestaurantIndexPage tests renders three restaurants without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
