[Killed] StringLiteral
main/components/Apartments/ApartmentForm.js:6:71
 import { useForm } from 'react-hook-form'
 import { useNavigate } from 'react-router-dom';
 
-function ApartmentForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+function ApartmentForm({ initialContents, submitAction, buttonLabel = "" }) {
 
     const navigate = useNavigate();
killedBy: ApartmentCreatePage tests redirects to /apartments on submit
statusReason: TestingLibraryElementError: Unable to find an element with the text: Create. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
