[Killed] ArrowFunction
main/pages/Restaurants/RestaurantCreatePage.js:9:31
 
 export default function RestaurantCreatePage() {
 
-  const objectToAxiosParams = (Restaurant) => ({
-    url: "/api/restaurant/post",
-    method: "POST",
-    params: {
-      name: Restaurant.name,
-      description: Restaurant.description
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (Restaurant) => {
killedBy: RestaurantCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Restaurants/RestaurantCreatePage.js:10:10
 export default function RestaurantCreatePage() {
 
   const objectToAxiosParams = (Restaurant) => ({
-    url: "/api/restaurant/post",
+    url: "",
     method: "POST",
     params: {
killedBy: RestaurantCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Restaurant Created - id: 17 name: Freebirds"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/Restaurants/RestaurantCreatePage.js:18:37
     }
   });
 
-  const onSuccess = (Restaurant) => {
-    toast(`New Restaurant Created - id: ${Restaurant.id} name: ${Restaurant.name}`);
-  }
+  const onSuccess = (Restaurant) => {}
 
   const mutation = useBackendMutation(
killedBy: RestaurantCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Restaurant Created - id: 17 name: Freebirds"

Number of calls: 0

[Killed] StringLiteral
main/pages/Restaurants/RestaurantCreatePage.js:19:11
   });
 
   const onSuccess = (Restaurant) => {
-    toast(`New Restaurant Created - id: ${Restaurant.id} name: ${Restaurant.name}`);
+    toast(``);
   }
 
killedBy: RestaurantCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Restaurant Created - id: 17 name: Freebirds"
Received: ""

Number of calls: 1
