[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantDetailsPage.js:15:7
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       [`/api/restaurant?id=${id}`],
-      {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-        method: "GET",
-        url: `/api/restaurant`,
-        params: {
-          id
-        }
-      }
+      {}
     );
 
killedBy: RestaurantDetailsPage tests loads the correct fields, and no buttons
statusReason: Error: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/Restaurants/RestaurantDetailsPage.js:17:14
       [`/api/restaurant?id=${id}`],
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
-        url: `/api/restaurant`,
+        url: ``,
         params: {
           id
killedBy: RestaurantDetailsPage tests loads the correct fields, and no buttons
statusReason: Error: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/Restaurants/RestaurantDetailsPage.js:28:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Restaurant Details</h1>
-        {restaurant && <RestaurantTable restaurants={[restaurant]} showButtons={false} />}
+        {false}
       </div>
     </BasicLayout>
killedBy: RestaurantDetailsPage tests loads the correct fields, and no buttons
statusReason: Error: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/Restaurants/RestaurantDetailsPage.js:28:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Restaurant Details</h1>
-        {restaurant && <RestaurantTable restaurants={[restaurant]} showButtons={false} />}
+        {restaurant || <RestaurantTable restaurants={[restaurant]} showButtons={false} />}
       </div>
     </BasicLayout>
killedBy: RestaurantDetailsPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'subRows')
