[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantEditPage.js:18:17
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
         url: `/api/restaurant`,
-        params: {
-          id
-        }
+        params: {}
       }
     );
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/Restaurants/RestaurantEditPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (restaurant) => ({
-    url: "/api/restaurant",
-    method: "PUT",
-    params: {
-      id: restaurant.id,
-    },
-    data: {
-      name: restaurant.name,
-      description: restaurant.description
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (restaurant) => {
killedBy: RestaurantEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant Updated - id: 17 name: Olive Garden"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantEditPage.js:25:51
     );
 
 
-  const objectToAxiosPutParams = (restaurant) => ({
-    url: "/api/restaurant",
-    method: "PUT",
-    params: {
-      id: restaurant.id,
-    },
-    data: {
-      name: restaurant.name,
-      description: restaurant.description
-    }
-  });
+  const objectToAxiosPutParams = (restaurant) => ({});
 
   const onSuccess = (restaurant) => {
killedBy: RestaurantEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant Updated - id: 17 name: Olive Garden"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/Restaurants/RestaurantEditPage.js:27:13
 
   const objectToAxiosPutParams = (restaurant) => ({
     url: "/api/restaurant",
-    method: "PUT",
+    method: "",
     params: {
       id: restaurant.id,
killedBy: RestaurantEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant Updated - id: 17 name: Olive Garden"
Received: "Restaurant Updated - id: 17 name: Red Lobster"

Number of calls: 1

[Killed] ConditionalExpression
main/pages/Restaurants/RestaurantEditPage.js:62:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Restaurant</h1>
-        {restaurant &&
-          <RestaurantForm initialRestaurant={restaurant} submitAction={onSubmit} buttonLabel="Update" />
+        {false
         }
       </div>
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/Restaurants/RestaurantEditPage.js:62:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Restaurant</h1>
-        {restaurant &&
-          <RestaurantForm initialRestaurant={restaurant} submitAction={onSubmit} buttonLabel="Update" />
+        {true
         }
       </div>
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
