[Killed] BlockStatement
main/components/Apartments/ApartmentTable.js:9:47
 const showCell = (cell) => JSON.stringify(cell.row.values);
 
 
-const defaultDeleteCallback = async (cell) => {
-    console.log(`deleteCallback: ${showCell(cell)})`);
-    apartmentUtils.del(cell.row.values.id);
-}
+const defaultDeleteCallback = async (cell) => {}
 
 export default function ApartmentTable({
killedBy: ApartmentTable tests Delete button calls delete callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Apartments/ApartmentTable.js:18:20
     apartments,
     deleteCallback = defaultDeleteCallback,
     showButtons = true,
-    testIdPrefix = "ApartmentTable" }) {
+    testIdPrefix = "" }) {
 
     const navigate = useNavigate();
killedBy: ApartmentTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ApartmentTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/Apartments/ApartmentTable.js:22:36
 
     const navigate = useNavigate();
  
-    const editCallback = (cell) => {
-        console.log(`editCallback: ${showCell(cell)})`);
-        navigate(`/apartments/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     const detailsCallback = (cell) => {
killedBy: ApartmentTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/apartments/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/Apartments/ApartmentTable.js:27:39
         navigate(`/apartments/edit/${cell.row.values.id}`)
     }
 
-    const detailsCallback = (cell) => {
-        console.log(`detailsCallback: ${showCell(cell)})`);
-        navigate(`/apartments/details/${cell.row.values.id}`)
-    }
+    const detailsCallback = (cell) => {}
 
     const columns = [
killedBy: ApartmentTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/apartments/details/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Apartments/ApartmentTable.js:47:21
             accessor: 'address',
         },
         {
-            Header: 'City',
+            Header: "",
             accessor: 'city',
         },
killedBy: ApartmentTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: City. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Apartments/ApartmentTable.js:48:23
         },
         {
             Header: 'City',
-            accessor: 'city',
+            accessor: "",
         },
         {
killedBy: ApartmentTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ApartmentTable-cell-row-0-col-city"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
