[Killed] BlockStatement
main/pages/Apartments/ApartmentCreatePage.js:6:47
 import { useNavigate } from 'react-router-dom'
 import { apartmentUtils } from 'main/utils/apartmentUtils';
 
-export default function ApartmentCreatePage() {
-
-  let navigate = useNavigate(); 
-
-  const onSubmit = async (apartment) => {
-    const createdApartment = apartmentUtils.add(apartment);
-    console.log("createdApartment: " + JSON.stringify(createdApartment));
-    navigate("/apartments");
-  }  
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create New Apartment</h1>
-        <ApartmentForm submitAction={onSubmit} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function ApartmentCreatePage() {}
killedBy: ApartmentCreatePage tests renders without crashing
statusReason: Error: ApartmentCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Apartments/ApartmentCreatePage.js:10:41
 
   let navigate = useNavigate(); 
 
-  const onSubmit = async (apartment) => {
-    const createdApartment = apartmentUtils.add(apartment);
-    console.log("createdApartment: " + JSON.stringify(createdApartment));
-    navigate("/apartments");
-  }  
+  const onSubmit = async (apartment) => {}  
 
   return (
killedBy: ApartmentCreatePage tests redirects to /apartments on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
