[Killed] BlockStatement
main/pages/Apartments/ApartmentDetailsPage.js:6:48
 import ApartmentTable from 'main/components/Apartments/ApartmentTable';
 import { apartmentUtils } from 'main/utils/apartmentUtils';
 
-export default function ApartmentDetailsPage() {
-  let { id } = useParams();
-
-  const response = apartmentUtils.getById(id);
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Apartment Details</h1>
-        <ApartmentTable apartments={[response.apartment]} showButtons={false} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function ApartmentDetailsPage() {}
 
killedBy: ApartmentDetailsPage tests renders without crashing
statusReason: Error: ApartmentDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BooleanLiteral
main/pages/Apartments/ApartmentDetailsPage.js:15:72
     <BasicLayout>
       <div className="pt-2">
         <h1>Apartment Details</h1>
-        <ApartmentTable apartments={[response.apartment]} showButtons={false} />
+        <ApartmentTable apartments={[response.apartment]} showButtons={true} />
       </div>
     </BasicLayout>
killedBy: ApartmentDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="ApartmentTable-header-Delete"
  role="columnheader"
