[Killed] BlockStatement
main/pages/Apartments/ApartmentEditPage.js:9:45
 import { useNavigate } from 'react-router-dom'
 
 
-export default function ApartmentEditPage() {
-    let { id } = useParams();
-
-    let navigate = useNavigate(); 
-
-    const response = apartmentUtils.getById(id);
-
-    const onSubmit = async (apartment) => {
-        const updatedApartment = apartmentUtils.update(apartment);
-        console.log("updatedApartment: " + JSON.stringify(updatedApartment));
-        navigate("/apartments");
-    }  
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit Apartment</h1>
-                <ApartmentForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.apartment}/>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function ApartmentEditPage() {}
killedBy: ApartmentEditPage tests renders without crashing
statusReason: Error: ApartmentEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Apartments/ApartmentEditPage.js:16:43
 
     const response = apartmentUtils.getById(id);
 
-    const onSubmit = async (apartment) => {
-        const updatedApartment = apartmentUtils.update(apartment);
-        console.log("updatedApartment: " + JSON.stringify(updatedApartment));
-        navigate("/apartments");
-    }  
+    const onSubmit = async (apartment) => {}  
 
     return (
killedBy: ApartmentEditPage tests redirects to /apartments on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Apartments/ApartmentEditPage.js:19:18
     const onSubmit = async (apartment) => {
         const updatedApartment = apartmentUtils.update(apartment);
         console.log("updatedApartment: " + JSON.stringify(updatedApartment));
-        navigate("/apartments");
+        navigate("");
     }  
 
killedBy: ApartmentEditPage tests redirects to /apartments on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/apartments"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/pages/Apartments/ApartmentEditPage.js:26:69
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Apartment</h1>
-                <ApartmentForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.apartment}/>
+                <ApartmentForm submitAction={onSubmit} buttonLabel={""} initialContents={response.apartment}/>
             </div>
         </BasicLayout>
killedBy: ApartmentEditPage tests redirects to /apartments on submit
statusReason: TestingLibraryElementError: Unable to find an element with the text: Update. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
