[Killed] BlockStatement
main/pages/Apartments/ApartmentIndexPage.js:17:44
 
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
-    const deleteCallback = async (cell) => {
-        console.log(`ApartmentIndexPage deleteCallback: ${showCell(cell)})`);
-        apartmentUtils.del(cell.row.values.id);
-        navigate("/apartments");
-    }
+    const deleteCallback = async (cell) => {}
 
     return (
killedBy: ApartmentIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
main/pages/Apartments/ApartmentIndexPage.js:20:18
     const deleteCallback = async (cell) => {
         console.log(`ApartmentIndexPage deleteCallback: ${showCell(cell)})`);
         apartmentUtils.del(cell.row.values.id);
-        navigate("/apartments");
+        navigate("");
     }
 
killedBy: ApartmentIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/apartments"
Received: ""

Number of calls: 1

<html>
