[Killed] BlockStatement
src/main/utils/apartmentUtils.js:2:19
 // get apartments from local storage
-const get = () => {
-    const apartmentValue = localStorage.getItem("apartments");
-    if (apartmentValue === undefined) {
-        const apartmentCollection = { nextId: 1, apartments: [] }
-        return set(apartmentCollection);
-    }
-    const apartmentCollection = JSON.parse(apartmentValue);
-    if (apartmentCollection === null) {
-        const apartmentCollection = { nextId: 1, apartments: [] }
-        return set(apartmentCollection);
-    }
-    return apartmentCollection;
-};
+const get = () => {};
 
 const getById = (id) => {
killedBy: ApartmentTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'apartments')

[Killed] ConditionalExpression
src/main/utils/apartmentUtils.js:4:9
 // get apartments from local storage
 const get = () => {
     const apartmentValue = localStorage.getItem("apartments");
-    if (apartmentValue === undefined) {
+    if (true) {
         const apartmentCollection = { nextId: 1, apartments: [] }
         return set(apartmentCollection);
killedBy: apartmentUtils tests get When apartments is [] in local storage, should return []
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "apartments", "{\"nextId\":1,\"apartments\":[]}"

[Killed] BlockStatement
src/main/utils/apartmentUtils.js:4:39
 // get apartments from local storage
 const get = () => {
     const apartmentValue = localStorage.getItem("apartments");
-    if (apartmentValue === undefined) {
-        const apartmentCollection = { nextId: 1, apartments: [] }
-        return set(apartmentCollection);
-    }
+    if (apartmentValue === undefined) {}
     const apartmentCollection = JSON.parse(apartmentValue);
     if (apartmentCollection === null) {
killedBy: apartmentUtils tests get When apartments is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] ArrayDeclaration
src/main/utils/apartmentUtils.js:5:62
 const get = () => {
     const apartmentValue = localStorage.getItem("apartments");
     if (apartmentValue === undefined) {
-        const apartmentCollection = { nextId: 1, apartments: [] }
+        const apartmentCollection = { nextId: 1, apartments: ["Stryker was here"] }
         return set(apartmentCollection);
     }
killedBy: apartmentUtils tests get When apartments is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
-   "apartments": Array [],
+   "apartments": Array [

[Killed] ConditionalExpression
src/main/utils/apartmentUtils.js:9:9
         return set(apartmentCollection);
     }
     const apartmentCollection = JSON.parse(apartmentValue);
-    if (apartmentCollection === null) {
+    if (false) {
         const apartmentCollection = { nextId: 1, apartments: [] }
         return set(apartmentCollection);
killedBy: apartmentUtils tests get When apartments is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"apartments": [], "nextId": 1}
Received: null

[Killed] EqualityOperator
src/main/utils/apartmentUtils.js:9:9
         return set(apartmentCollection);
     }
     const apartmentCollection = JSON.parse(apartmentValue);
-    if (apartmentCollection === null) {
+    if (apartmentCollection !== null) {
         const apartmentCollection = { nextId: 1, apartments: [] }
         return set(apartmentCollection);
killedBy: apartmentUtils tests get When apartments is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"apartments": [], "nextId": 1}
Received: null

[Killed] BlockStatement
src/main/utils/apartmentUtils.js:16:25
     return apartmentCollection;
 };
 
-const getById = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const apartmentCollection = get();
-    const apartments = apartmentCollection.apartments;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = apartments.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `apartment with id ${id} not found` };
-    }
-    return { apartment: apartments[index] };
-}
+const getById = (id) => {}
 
 // set apartments in local storage
killedBy: apartmentUtils tests getById Check that getting an apartment by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"apartment": {"address": "650 Storke Road", "city": "Goleta", "description": "Nice but Far", "id": 3, "name": "San Joaquin North Villages", "rooms": 166, "state": "CA"}}
Received: undefined

[Killed] ConditionalExpression
src/main/utils/apartmentUtils.js:24:47
     const apartments = apartmentCollection.apartments;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = apartments.findIndex((r) => r.id == id);
+    const index = apartments.findIndex((r) => false);
     if (index === -1) {
         return { "error": `apartment with id ${id} not found` };
killedBy: apartmentUtils tests getById Check that getting an apartment by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

  Object {
-   "apartment": Object {
-     "address": "650 Storke Road",

[Killed] EqualityOperator
src/main/utils/apartmentUtils.js:24:47
     const apartments = apartmentCollection.apartments;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = apartments.findIndex((r) => r.id == id);
+    const index = apartments.findIndex((r) => r.id != id);
     if (index === -1) {
         return { "error": `apartment with id ${id} not found` };
killedBy: apartmentUtils tests getById Check that getting an apartment by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Object {
    "apartment": Object {
-     "address": "650 Storke Road",

[Killed] EqualityOperator
src/main/utils/apartmentUtils.js:25:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = apartments.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index !== -1) {
         return { "error": `apartment with id ${id} not found` };
     }
killedBy: apartmentUtils tests getById Check that getting an apartment by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

  Object {
-   "apartment": Object {
-     "address": "650 Storke Road",

[Killed] BlockStatement
src/main/utils/apartmentUtils.js:25:23
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = apartments.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `apartment with id ${id} not found` };
-    }
+    if (index === -1) {}
     return { apartment: apartments[index] };
 }
killedBy: apartmentUtils tests getById Check that getting a non-existing apartment returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "apartment with id 99 not found",
+   "apartment": undefined,

[Killed] ObjectLiteral
src/main/utils/apartmentUtils.js:26:16
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = apartments.findIndex((r) => r.id == id);
     if (index === -1) {
-        return { "error": `apartment with id ${id} not found` };
+        return {};
     }
     return { apartment: apartments[index] };
killedBy: apartmentUtils tests getById Check that getting a non-existing apartment returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "apartment with id 99 not found",
- }

[Killed] ObjectLiteral
src/main/utils/apartmentUtils.js:28:12
     if (index === -1) {
         return { "error": `apartment with id ${id} not found` };
     }
-    return { apartment: apartments[index] };
+    return {};
 }
 
killedBy: apartmentUtils tests getById Check that getting an apartment by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 11
+ Received  +  1

- Object {
-   "apartment": Object {
-     "address": "650 Storke Road",

[Killed] BlockStatement
src/main/utils/apartmentUtils.js:32:38
 }
 
 // set apartments in local storage
-const set = (apartmentCollection) => {
-    localStorage.setItem("apartments", JSON.stringify(apartmentCollection));
-    return apartmentCollection;
-};
+const set = (apartmentCollection) => {};
 
 // add a apartment to local storage
killedBy: apartmentUtils tests get When apartments is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"apartments": [], "nextId": 1}
Received: undefined

[Killed] BlockStatement
src/main/utils/apartmentUtils.js:38:28
 };
 
 // add a apartment to local storage
-const add = (apartment) => {
-    const apartmentCollection = get();
-    apartment = { ...apartment, id: apartmentCollection.nextId };
-    apartmentCollection.nextId++;
-    apartmentCollection.apartments.push(apartment);
-    set(apartmentCollection);
-    return apartment;
-};
+const add = (apartment) => {};
 
 // update a apartment in local storage
killedBy: apartmentUtils tests add Starting from [], check that adding one apartment works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"address": "555 Storke Road", "city": "Goleta", "description": "Nice and New", "id": 1, "name": "Sierra Madre Villages", "rooms": 109, "state": "CA"}
Received: undefined

[Killed] ObjectLiteral
src/main/utils/apartmentUtils.js:40:17
 // add a apartment to local storage
 const add = (apartment) => {
     const apartmentCollection = get();
-    apartment = { ...apartment, id: apartmentCollection.nextId };
+    apartment = {};
     apartmentCollection.nextId++;
     apartmentCollection.apartments.push(apartment);
killedBy: apartmentUtils tests add Starting from [], check that adding one apartment works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

- Object {
-   "address": "555 Storke Road",
-   "city": "Goleta",

[Killed] UpdateOperator
src/main/utils/apartmentUtils.js:41:5
 const add = (apartment) => {
     const apartmentCollection = get();
     apartment = { ...apartment, id: apartmentCollection.nextId };
-    apartmentCollection.nextId++;
+    apartmentCollection.nextId--;
     apartmentCollection.apartments.push(apartment);
     set(apartmentCollection);
killedBy: apartmentUtils tests add Starting from [], check that adding one apartment works
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "apartments", "{\"nextId\":2,\"apartments\":[{\"id\":1,\"name\":\"Sierra Madre Villages\",\"address\":\"555 Storke Road\",\"city\":\"Goleta\",\"state\":\"CA\",\"rooms\":109,\"description\":\"Nice and New\"}]}"
Received: "apartments", "{\"nextId\":0,\"apartments\":[{\"id\":1,\"name\":\"Sierra Madre Villages\",\"address\":\"555 St

[Killed] BlockStatement
src/main/utils/apartmentUtils.js:48:31
 };
 
 // update a apartment in local storage
-const update = (apartment) => {
-    const apartmentCollection = get();
-
-    const apartments = apartmentCollection.apartments;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = apartments.findIndex((r) => r.id == apartment.id);
-    if (index === -1) {
-        return { "error": `apartment with id ${apartment.id} not found` };
-    }
-    apartments[index] = apartment;
-    set(apartmentCollection);
-    return { apartmentCollection: apartmentCollection };
-};
+const update = (apartment) => {};
 
 // delete a apartment from local storage
killedBy: apartmentUtils tests update Check that updating an existing apartment works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ConditionalExpression
src/main/utils/apartmentUtils.js:54:47
     const apartments = apartmentCollection.apartments;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = apartments.findIndex((r) => r.id == apartment.id);
+    const index = apartments.findIndex((r) => true);
     if (index === -1) {
         return { "error": `apartment with id ${apartment.id} not found` };
killedBy: apartmentUtils tests update Check that updating an non-existing apartment returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 28

  Object {
-   "error": "apartment with id 99 not found",
+   "apartmentCollection": Object {

[Killed] ArrowFunction
src/main/utils/apartmentUtils.js:54:40
     const apartments = apartmentCollection.apartments;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = apartments.findIndex((r) => r.id == apartment.id);
+    const index = apartments.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `apartment with id ${apartment.id} not found` };
killedBy: apartmentUtils tests update Check that updating an existing apartment works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 32
+ Received  +  1

  Object {
-   "apartmentCollection": Object {
-     "apartments": Array [

[Killed] BlockStatement
src/main/utils/apartmentUtils.js:55:23
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = apartments.findIndex((r) => r.id == apartment.id);
-    if (index === -1) {
-        return { "error": `apartment with id ${apartment.id} not found` };
-    }
+    if (index === -1) {}
     apartments[index] = apartment;
     set(apartmentCollection);
killedBy: apartmentUtils tests update Check that updating an non-existing apartment returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 32

  Object {
-   "error": "apartment with id 99 not found",
+   "apartmentCollection": Object {

[Killed] EqualityOperator
src/main/utils/apartmentUtils.js:55:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = apartments.findIndex((r) => r.id == apartment.id);
-    if (index === -1) {
+    if (index !== -1) {
         return { "error": `apartment with id ${apartment.id} not found` };
     }
killedBy: apartmentUtils tests update Check that updating an existing apartment works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 32
+ Received  +  1

  Object {
-   "apartmentCollection": Object {
-     "apartments": Array [

[Killed] BlockStatement
src/main/utils/apartmentUtils.js:64:21
 };
 
 // delete a apartment from local storage
-const del = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const apartmentCollection = get();
-    const apartments = apartmentCollection.apartments;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = apartments.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `apartment with id ${id} not found` };
-    }
-    apartments.splice(index, 1);
-    set(apartmentCollection);
-    return { apartmentCollection: apartmentCollection };
-};
+const del = (id) => {};
 
 const apartmentUtils = {
killedBy: apartmentUtils tests del Check that deleting an apartment by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ArrowFunction
src/main/utils/apartmentUtils.js:72:40
     const apartments = apartmentCollection.apartments;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = apartments.findIndex((r) => r.id == id);
+    const index = apartments.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `apartment with id ${id} not found` };
killedBy: apartmentUtils tests del Check that deleting an apartment by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "apartmentCollection": Object {
-     "apartments": Array [

[Killed] ConditionalExpression
src/main/utils/apartmentUtils.js:73:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = apartments.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (false) {
         return { "error": `apartment with id ${id} not found` };
     }
killedBy: apartmentUtils tests del Check that deleting a non-existing apartment returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 23

  Object {
-   "error": "apartment with id 99 not found",
+   "apartmentCollection": Object {

[Killed] UnaryOperator
src/main/utils/apartmentUtils.js:73:19
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = apartments.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index === +1) {
         return { "error": `apartment with id ${id} not found` };
     }
killedBy: apartmentUtils tests del Check that deleting an apartment by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "apartmentCollection": Object {
-     "apartments": Array [
